tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
brew "ack"
brew "openssl@1.1"
brew "readline"
brew "awscli"
brew "coreutils"
brew "fasd"
brew 'gist'
brew "git-flow"
brew 'go'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting'
brew 'git-flow'
brew 'fasd'
brew 'mergepbx'
