# Homebrew Bundle file for dotfiles
# This file is idempotent - run it multiple times safely

# Set default arguments for casks
cask_args appdir: '/Applications'

# Note: homebrew/bundle and homebrew/services are now built-in, no taps needed

# Core tools
brew "git"
brew "git-flow"
brew "gh"                    # GitHub CLI
brew "gist"                  # GitHub gist
brew "wget"
brew "curl"
brew "coreutils"             # GNU core utilities
brew "findutils"             # GNU find, xargs, locate
brew "gnu-sed"               # GNU sed
brew "gawk"                  # GNU awk
brew "grep"                  # GNU grep

# Terminal and shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "bash"                  # Latest bash
brew "bash-completion@2"

# Development tools
brew "node"                  # Node.js
brew "python@3.12"           # Python
brew "ruby"
brew "rbenv"                 # Ruby version manager
brew "ruby-build"
brew "nvm"                   # Node Version Manager
brew "yarn"                  # Alternative npm client
brew "mise"                  # Multi-language version manager

# Terminal productivity
brew "tmux"                  # Terminal multiplexer
brew "grc"                   # Generic colouriser
brew "zoxide"                # Smart directory jumping (fasd replacement)
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "fd"                    # Better find
brew "ripgrep"               # Better grep
brew "fzf"                   # Fuzzy finder
brew "tree"                  # Directory tree
brew "htop"                  # Better top
brew "tldr"                  # Simplified man pages
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor

# AWS tools
brew "awscli"
brew "aws-sam-cli"

# Database tools
brew "postgresql@16"
brew "mysql"
brew "redis"

# Image and media tools
brew "imagemagick"
brew "jp2a"                  # JPEG to ASCII
brew "libcaca"               # Color ASCII art

# Development utilities
brew "openssl"
brew "readline"
brew "libgit2"
brew "pkg-config"
brew "cmake"

# Swift development  
brew "xcode-build-server"    # Xcode build server
brew "swiftlint"             # Swift linter
brew "swiftformat"           # Swift formatter
# Note: swiftenv is no longer maintained, use mise instead

# Container and DevOps tools
brew "docker"                # Docker CLI (without Desktop GUI)
brew "docker-compose"        # Docker compose CLI
brew "kubectl"               # Kubernetes CLI
brew "helm"                  # Kubernetes package manager

# Other utilities
brew "ack"                   # Better grep for code
brew "roundup"               # Test harness
brew "spaceman-diff"         # Diff images in terminal
brew "spark"                 # Sparklines for shell
brew "nano"                  # Text editor
brew "watchman"              # File watching service
brew "graphviz"              # Graph visualization

# Perl (for some git addons)
brew "perl"

# Fonts
cask "font-meslo-lg-nerd-font"  # Powerline font for terminal

# GUI Applications
cask "amazon-q"              # Amazon Q AI assistant
cask "tuist"                 # Swift project generator

# Optional GUI applications (uncomment as needed):
# cask "iterm2"                # Terminal emulator  
# cask "visual-studio-code"    # VS Code
# cask "docker"                # Docker Desktop (GUI)
